import re
import datetime

# 采集人姓名
COLLECTOR_NAME = ""

# 学校和学院名称
SCHOOL_NAME = ""         
COLLEGE_NAME = ""    

# 教师列表页URL
LIST_URLS = [
    ""
]

# 数据输出路径
OUTPUT_FILE = "D:\\Tea_Get\\采集结果.csv"

# 同时抓取的最大线程数，建议5-15之间
MAX_WORKERS = 15

# 自动获取当天日期
COLLECT_DATE = datetime.date.today().strftime("%Y/%m/%d")

# 使用正则进行黑名单词汇过滤：排除非教师姓名的导航、栏目或业务链接文本
_exclude_words = [
    '首页', '上一页', '下一页', '末页', '更多', '返回', '党', '下载', '版权', '纪检'
    '介绍','学科专业','科学研究','竞赛','通知公告','专任教师','人才计划','国际会议','支部风采',
    '新闻', '概况', '师资', '招生', '就业', '科研', '合作', '邮箱', '通信工程','MORE',
    'ENGLISH','双聘教授','系统', '工作','公告', '通知', '政策', '服务', '资源', '帮助','党委', 
    '工会', '纪委', '成果', '平台', '评估', '门户', '专栏', '活动','关于我们', '党务',
    '旧版', '英文', 'English', '系统', '登录', '管理', '关闭','加入收藏', '支部建设',
    '设为首页', '联系我们', '网站地图', '隐私政策', '使用条款','关工委','国际交流','Previous'
]
EXCLUDE_REGEX = re.compile('|'.join(map(re.escape, _exclude_words)), re.IGNORECASE)

# 单姓字典
COMMON_SURNAMES = set("赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔盖闫曹严华金魏陶姜" \
"戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安" \
"常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝" \
"董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干" \
"解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮气储靳汲邴糜松井段富巫" \
"乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白" \
"怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴胥能苍双闻莘翟谭贡劳逄姬申扶堵冉宰郦雍璩桑桂濮牛寿通边扈燕冀")

# 复姓字典
COMPOUND_SURNAMES = {
    "万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方","赫连","皇甫",
    "尉迟","公羊","澹台","公冶","宗政","濮阳","淳于","单于","太叔","申屠",
    "公孙","仲孙","轩辕","令狐","钟离","宇文","长孙","慕容","鲜于","闾丘"
}
